## Food Balance Sheets

The dataset is provided by the Food and Agriculture Organization of the United Nations

## Import Libraries

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Load the dataset
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding = "latin-1")
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [4]:
df.shape
print(f"The shape of the dataframe is {df.shape}")

The shape of the dataframe is (60943, 12)

In [5]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [6]:
# Checking for duplicates
df.duplicated().sum()

0

In [7]:
#Checking for null values
df.isnull().sum()

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

## Quiz Questions

1. What is the total Protein supply quantity in Madagascar in 2015?

In [8]:
df[df['Area'] == 'Madagascar'][['Y2015','Element']].groupby(['Element']).sum()

                                           Y2015
Element
Domestic supply quantity                31214.98
Export Quantity                           494.75
Fat supply quantity (g/capita/day)         91.85
Feed                                     2070.22
Food                                    21120.65
Food supply (kcal/capita/day)            7685.00
Food supply quantity (kg/capita/yr)       871.59
Import Quantity                          1721.80
Losses                                   2176.00
Other uses (non-food)                    3957.12
Processing                               1803.00
Production                              29482.89
Protein supply quantity (g/capita/day)    173.05
Residuals                                -616.00
Seed                                      699.00
Stock Variation                          -505.00
Total Population - Both sexes           24234.00

3. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the highest sum in 2017?

In [9]:
df["Area"].groupby(by = df["Y2017"]).sum().value_counts()

Egypt                                               146
Nigeria                                             144
South Africa                                        127
Morocco                                             115
United Republic of Tanzania                         106
                                                   ...
BotswanaGhanaGhanaMauritaniaSudan                     1
AlgeriaBeninCôte d'IvoireMaliNigeriaNigeria           1
GabonTogoUgandaUganda                                 1
GuineaMauritiusSouth AfricaUgandaUgandaUganda         1
South AfricaSouth AfricaSouth AfricaSouth Africa      1
Name: Area, Length: 1710, dtype: int64

4. What is the total sum of Wine produced in 2015 and 2018 respectively?

Hint:

Perform a groupby sum aggregation on ‘Item’

In [10]:
df[df['Item'] == 'Wine'].groupby(by = df["Item"]).sum(numeric_only = True)

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Item,,,,,,,,
Wine,66206,1319535,1818328,4497.36,4251.81,3872.09,4178.02,4039.32

6. What is the total number and percentage of missing data in 2014 to 3 decimal places?

In [11]:
missing_data = df["Y2014"].isna().sum()

percent_missing_data = (missing_data/df.shape)*100
print (missing_data)
print (percent_missing_data)

1589
[2.60735441e+00 1.32416667e+04]

8. Perform a groupby operation on ‘Element’.  What year has the highest sum of Stock Variation?

In [12]:
df[df["Element"] == "Stock Variation"].groupby(by = "Element").sum(numeric_only = True)

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Element,,,,,,,,
Stock Variation,571566,11329527,21464704,58749.83,34910.99,33140.12,54316.91,20577.91

10. What is the mean and standard deviation across the whole dataset for the year 2017 to 2 decimal places?

In [13]:
print(round(df["Y2017"].mean(),2))
print(round(df["Y2017"].std(),2))

140.92
1671.86

12. Perform a groupby operation on ‘Element’.  What is the total number of the sum of Processing in 2017?

In [14]:
df[df["Element"] == "Processing"].groupby(by = "Element").sum(numeric_only = True)

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Element,,,,,,,,
Processing,271940,5350416,10313310,282923.0,287929.0,280631.0,292836.0,308429.0

13. What is the total number of unique countries in the dataset?

In [15]:
df["Area"].nunique()

49

14. Which year had the least correlation with ‘Element Code’?

In [16]:
df.corr(numeric_only = True)

,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
Area Code,1.000000,-0.005159,-0.000209,0.006164,0.005472,0.005247,0.005006,0.005665
Item Code,-0.005159,1.000000,-0.024683,0.021722,0.020857,0.020109,0.021494,0.021314
Element Code,-0.000209,-0.024683,1.000000,0.024457,0.023889,0.023444,0.024254,0.024279
Y2014,0.006164,0.021722,0.024457,1.000000,0.994647,0.996081,0.995230,0.994872
Y2015,0.005472,0.020857,0.023889,0.994647,1.000000,0.995739,0.988048,0.988208
Y2016,0.005247,0.020109,0.023444,0.996081,0.995739,1.000000,0.992785,0.992757
Y2017,0.005006,0.021494,0.024254,0.995230,0.988048,0.992785,1.000000,0.998103
Y2018,0.005665,0.021314,0.024279,0.994872,0.988208,0.992757,0.998103,1.000000

**Year 2016**

18. Select columns ‘Y2017’ and ‘Area’, Perform a groupby operation on ‘Area’.  Which of these Areas had the 7th lowest sum in 2017?

In [17]:
df[["Y2017", "Area"]].groupby(by = df["Area"]).sum(numeric_only = True).sort_values(by = "Y2017").iloc[6]

Y2017    19102.77
Name: Guinea-Bissau, dtype: float64